GREETING = "Игра Висилица. Добро пожаловать!"

MENU_START_GAME = "Для начала новой игры нажмите (Н)"
MENU_EXIT_GAME = "Для выхода нажмите (В)"
MENU_INCORRECT_ANSWER = "Неправильный ввод. Введите еще раз."
MENU_CHOICE = "Ваш выбор: "

EVENT_INPUT = "Введите букву: "
EVENT_RIGHT_ANSWER = "Верно, эта буква есть в слове"
EVENT_BAD_ANSWER = "К сожалению, этой буквы нет в слове"
EVENT_REPETED_LETTER = "Вы уже называли эту букву"

EVENT_WIN = "Вы победили! Загаданное слово было - "
EVENT_LOOSE = "Вы проиграли! Загаданное слово было - "

LINE_PH = "----------------------------------------"

HANGMAN_PICS = {
    6: """
       --------
       |      |
       |      
       |    
       |      
       |     
       -
    """,
    5: """
       --------
       |      |
       |      O
       |    
       |      
       |     
       -
    """,
    4: """
       --------
       |      |
       |      O
       |      |
       |      
       |     
       -
    """,
    3: """
       --------
       |      |
       |      O
       |     /|
       |      
       |     
       -
    """,
    2: """
       --------
       |      |
       |      O
       |     /|\\
       |      
       |     
       -
    """,
    1: """
       --------
       |      |
       |      O
       |     /|\\
       |     /
       |     
       -
    """,
    0: """
       --------
       |      |
       |      O
       |     /|\\
       |     / \\
       |     
       -
    """,
}
